# Brewfile — tracked by dotfiles, installed manually with: brew bundle
# NOT auto-installed by chezmoi. This is just a record of what you use.

# ── Core CLI ─────────────────────────────────────────────────────────────────
brew "git"
brew "zsh"
brew "tmux"
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "tree"
brew "tldr"

# ── Modern Unix ──────────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "delta"
brew "btop"

# ── Shell ────────────────────────────────────────────────────────────────────
brew "starship"
brew "chezmoi"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Git ──────────────────────────────────────────────────────────────────────
brew "gh"

# ── Languages ────────────────────────────────────────────────────────────────
brew "go"
brew "golangci-lint"
brew "node"
brew "pnpm"
brew "uv"

# ── Kubernetes ───────────────────────────────────────────────────────────────
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kubectx"

# ── Cloud ────────────────────────────────────────────────────────────────────
brew "awscli"

# ── Other ────────────────────────────────────────────────────────────────────
brew "ollama"

# ── Casks ────────────────────────────────────────────────────────────────────
cask "ghostty"
cask "iterm2"

# ── Fonts ────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
