# Brewfile — tracked by dotfiles
# Install: brew bundle --file=~/Vimit_Codebase/dotfiles/Brewfile

# ── Core CLI ─────────────────────────────────────────────────────────────────
brew "git"
brew "zsh"
brew "tmux"
brew "wget"
brew "curl"
brew "jq"
brew "yq"
brew "tree"
brew "tldr"
brew "httpie"               # user-friendly HTTP client (better curl for APIs)
brew "shellcheck"           # lint your shell scripts

# ── Modern Unix ──────────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "delta"
brew "btop"
brew "hyperfine"            # CLI benchmarking: hyperfine 'go build ./...'

# ── Shell ────────────────────────────────────────────────────────────────────
brew "starship"
brew "chezmoi"
brew "direnv"               # auto-load .envrc per project directory
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Version Manager ──────────────────────────────────────────────────────────
brew "mise"                 # manages Go, Node, Python versions per project

# ── Git ──────────────────────────────────────────────────────────────────────
brew "gh"
brew "lazygit"              # TUI for git — staging, rebase, branches
brew "git-extras"           # ~60 useful git commands (summary, effort, standup)

# ── Editors ──────────────────────────────────────────────────────────────────
brew "neovim"               # terminal editor

# ── Languages (tools that mise does NOT manage) ──────────────────────────────
brew "golangci-lint"        # Go linter (standalone binary, not a runtime)
brew "pnpm"                 # Node package manager

# ── Task Runner ──────────────────────────────────────────────────────────────
brew "just"                 # modern make alternative — project-specific commands

# ── Docker ───────────────────────────────────────────────────────────────────
brew "lazydocker"           # TUI for Docker containers, images, logs

# ── Kubernetes ───────────────────────────────────────────────────────────────
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kubectx"

# ── Cloud ────────────────────────────────────────────────────────────────────
brew "awscli"

# ── Other ────────────────────────────────────────────────────────────────────
brew "ollama"

# ── GUI Applications (shared across all machines) ───────────────────────────
# Machine-specific apps (Docker Desktop vs Colima) are in Brewfile.personal / Brewfile.work
cask "visual-studio-code"
cask "goland"
cask "slack"
cask "google-chrome"
cask "postman"

# ── Terminals ────────────────────────────────────────────────────────────────
cask "ghostty"
cask "iterm2"

# ── Fonts ────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
