# VS Code extensions — managed by chezmoi
# run_onchange script installs these automatically when this file changes

# Languages
golang.go
ms-python.python
ms-python.debugpy
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.vscode-typescript-next

# Containers & Cloud
docker.docker
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# Git & Collaboration
github.vscode-github-actions

# Formatting & Utilities
esbenp.prettier-vscode
mechatroner.rainbow-csv

# AI
google.geminicodeassist
